table = {
    'q1':{'a':['a', 1, 'q2'], ' ':[' ', 1, 'q1']},
    'q2':{'a':['a', 1, 'q2'], 'b':['b', 1, 'q2'], 'c':['c', 1, 'q2'], ' ':[' ', -1, 'q3']},
    'q3':{'a':['p', 1, 'q4'], 'b':['p', 1, 'q6'], 'c':['p', 1, 'q8']},
    'q4':{'p':['p', 1, 'q4'], ' ':[' ', 1, 'q5']},
    'q5':{'a':['a', 1, 'q5'], 'b':['b', 1, 'q5'], 'c':['c', 1, 'q5'], ' ':['a', -1, 'q10']},
    'q6':{'p':['p', 1, 'q6'], ' ':[' ', 1, 'q7']},
    'q7':{'a':['a', 1, 'q7'], 'b':['b', 1, 'q7'], 'c':['c', 1, 'q7'], ' ':['b', -1, 'q10']},
    'q8':{'p':['p', 1, 'q8'], ' ':[' ', 1, 'q9']},
    'q9':{'a':['a', 1, 'q9'], 'b':['b', 1, 'q9'], 'c':['c', 1, 'q9'], ' ':['c', -1, 'q10']},
    'q10':{'a':['a', -1, 'q10'], 'b':['b', -1, 'q10'], 'c':['c', -1, 'q10'], ' ':[' ', -1, 'q11']},
    'q11':{'a':['a', 0, 'q3'], 'b':['b', 0, 'q3'], 'c':['c', 0, 'q3'], 'p':['p', -1, 'q11'], ' ':['', 1, 'q12']},
    'q12':{'p':['', 1, 'q12'], ' ':['', 1, 'q13']}
}

tape = list(input())        #лента
tape.insert(0, " ")         #добавление пробела перед строкой
a = [" "]*14                #добавление пробелов после строки для новой переворачиваемой строки
tape += a
q = 'q1'                    #начальное состояние
n = 0                       #начальная позиция на ленте

while q != 'q13':                               #пока не конечное
    s, mov, state = table[q][tape[n]]
    tape[n] = s                                 #текущее значение
    n += mov                                    #текущая позиция на ленте
    q = state                                   #текущее состояние машины тьюринга
    
print(''.join(tape))