R = 1
N = 0
L = -1

table = {
    #дойти до символов
    'q1':{' ':[' ',R,'q1'], 'a':['a',L,'q2'], 'b':['b',L,'q2'], 'c':['c',L,'q2'] },
    # поставить старт строки
    'q2' : {' ':['S',R,'q3']},
    # дойти до конца слова
    'q3':{' ':['*',N,'q4'], 'a':['a',R,'q3'], 'b':['b',R,'q3'], 'c':['c',R,'q3'] },
    #вернуться до *
    'q4':{'a':['a',N,'q5'], 'b':['b',N,'q5'], 'c':['c',N,'q5'],'*':['*',L,'q4'],'S':['S',N,'qclear'],'A':['A',L,'q4'], 'B':['B',L,'q4'], 'C':['C',L,'q4']},
    #понять что переносить
    'q5':{'S':['S',L,'qclear'], 'a':['*',N,'qa1'], 'b':['*',N,'qb1'], 'c':['*',N,'qc1'],},
    #перенос a
    'qa1': {'*':['*',R,'qa1'],'*': ['*', R, 'qa1'], 'a': ['a', R, 'qa1'], 'b': ['b', R, 'qa1'], 'c': ['c', R, 'qa1'],' ':['A',N,'q4'], 'A': ['A', R, 'qa1'], 'B': ['B', R, 'qa1'], 'C': ['C', R, 'qa1']},
    #перенос b
    'qb1': {'*':['*',R,'qb1'],'*': ['*', R, 'qb1'], 'a': ['a', R, 'qb1'], 'b': ['b', R, 'qb1'], 'c': ['c', R, 'qb1'],' ':['B',N,'q4'], 'A': ['A', R, 'qb1'], 'B': ['B', R, 'qb1'], 'C': ['C', R, 'qb1']},
   #перенос c
    'qc1': {'*':['*',R,'qc1'],'*': ['*', R, 'qc1'], 'a': ['a', R, 'qc1'], 'b': ['b', R, 'qc1'], 'c': ['c', R, 'qc1'],' ':['C',N,'q4'], 'A': ['A', R, 'qc1'], 'B': ['B', R, 'qc1'], 'C': ['C', R, 'qc1']},
    'qclear':{'S':[' ',R,'qclear'],'*':[' ',R,'qclear'],'A':['a',R,'qclear'],'B':['b',R,'qclear'],'C':['c',R,'qclear'],' ':[' ',N,'qT']}
}



lenta = list('  '+input()+' '*20)
qState = 'q1'

index = 0

while qState != 'qT':
    s, step ,st = table[qState][lenta[index]]
    lenta[index] = s
    index += step
    qState=st

print(''.join(lenta).replace(' ',''))
