table = {
    'q1': {'a': ['a', 1, 'q2'], 'b': ['b', 1, 'q2'], 'c': ['c', 1, 'q2'], ' ': [' ', 1, 'q1']},# скипает пробелы до 1 символа
    'q2': {'a': ['a', 1, 'q2'], 'b': ['b', 1, 'q2'], 'c': ['c', 1, 'q2'], ' ': [' ', -1, 'q3']}, #бежит до бробела в конце
    'q3': {'a': ['a', -1, 'q4'], 'b': ['b', -1, 'q3'], 'c': ['c', -1, 'q3']}, #идет братно и если нахоодит а то в 4
    'q4': {'a': ['a', -1, 'q5'], 'b': ['b', -1, 'q3'], 'c': ['c', -1, 'q3']}, #идет дальше если находит 2 а то в 5 
    'q5': {'a': ['a', 1, 'q6'], 'b': ['b', 1, 'q7'], 'c': ['c', 1, 'q8']}, #после aa (a or b or c)  
    'q6': {'a': ['a', 1, 'q6'], 'b': ['a', 0, 'q0'], 'c': ['a', 0, 'q0'], ' ': ['a', 0, 'q0']},# заменяет если a 
    'q7': {'a': ['a', 1, 'q7'], 'b': ['b', 0, 'q0'], 'c': ['b', 0, 'q0'], ' ': ['b', 0, 'q0']},# заменяет если b 
    'q8': {'a': ['a', 1, 'q8'], 'b': ['c', 0, 'q0'], 'c': ['c', 0, 'q0'], ' ': ['c', 0, 'q0']},# заменяет если c 

}
memory = list(input())
state = 'q1'
ind = 0
while state != 'q0':
    act = table[state][memory[ind]]
    memory[ind] = act[0]
    ind += act[1]
    state = act[2]
print(''.join(memory))

