memory = list(input())
index = 0
state = 'q1'

#q1 - начальное состояние и поиск строки
#q2 - поиск первого встретившегося символа b, если первый символ не b
#q3 - переход к символу после b
#q4 - удаление b если b - последний символ
#q5 - возвращение в начало строки, если b в строке отсутствует
#q6 - удаление символа после b
#q7 - переход ко второму символу после b
#q8 - проверка, если b - предпоследний - удалить последний символ
#q9 - поиск символа для переноса
#q10 - замена символа на a
#q11 - замена символа на b
#q12 - замена символа на c
#q13 - замена символа на " "
#q14 - переход для поиска символа для переноса
#q15 - перенос влево для замены на a
#q16 - перенос влево для замены на b
#q17 - перенос влево для замены на c
#q18 - перенос влево для замены на " "
#q19 - второй переход для поиска символа для переноса
#q20 - если при замене в q13 символ " ", перемещаем пробел и переход в терминальное состояние
#q0 - терминальное состояние
table = {
    'q1': {
        ' ': [' ', 1, 'q1'], 
        'a': ['a', 1, 'q2'], 
        'b': ['b', 1, 'q3'], 
        'c': ['c', 1, 'q2'], 
        },
    'q2': {
        ' ': [' ', -1, 'q5'], 
        'a': ['a', 1, 'q2'], 
        'b': ['b', 1, 'q3'], 
        'c': ['c', 1, 'q2'], 
        },
    'q3': {
        ' ': [' ', -1, 'q4'], 
        'a': ['a', 1, 'q7'], 
        'b': ['b', 1, 'q7'], 
        'c': ['c', 1, 'q7'], 
        },
    'q4': {
            ' ': [' ', 0, 'q0'], 
            'a': [' ', 0, 'q0'], 
            'b': [' ', 0, 'q0'], 
            'c': [' ', 0, 'q0']
        },
    'q5': {
        ' ': [' ', 1, 'q6'], 
        'a': ['a', -1, 'q5'], 
        'c': ['c', -1, 'q5'], 
        },
    'q6': {
        'a': [' ', 0, 'q0'], 
        'c': [' ', 0, 'q0'], 
        },
    'q7': {
        ' ': [' ', -1, 'q8'], 
        'a': ['a', 1, 'q9'], 
        'b': ['b', 1, 'q9'], 
        'c': ['c', 1, 'q9'], 
        },
    'q8': {
        'a': [' ', -1, 'q0'], 
        'b': [' ', -1, 'q0'], 
        'c': [' ', -1, 'q0'], 
        },
    'q9': {
        ' ': [' ', -1, 'q18'], 
        'a': ['a', -1, 'q15'], 
        'b': ['b', -1, 'q16'], 
        'c': ['c', -1, 'q17'], 
        },
    'q10': {
        'a': ['a', 1, 'q14'], 
        'b': ['a', 1, 'q14'], 
        'c': ['a', 1, 'q14'], 
        },
    'q11': {
        'a': ['b', 1, 'q14'], 
        'b': ['b', 1, 'q14'], 
        'c': ['b', 1, 'q14'], 
        },
    'q12': {
        'a': ['c', 1, 'q14'], 
        'b': ['c', 1, 'q14'], 
        'c': ['c', 1, 'q14'], 
        },
    'q13': {
        ' ': [' ', 1, 'q20'], 
        'a': [' ', 1, 'q14'], 
        'b': [' ', 1, 'q14'], 
        'c': [' ', 1, 'q14'], 
        },
    'q14': {
        ' ': [' ', 0, 'q19'], 
        'a': ['a', 1, 'q19'], 
        'b': ['b', 1, 'q19'], 
        'c': ['c', 1, 'q19'], 
        },
    'q15': {
        ' ': [' ', -1, 'q10'], 
        'a': ['a', -1, 'q10'], 
        'b': ['b', -1, 'q10'], 
        'c': ['c', -1, 'q10'], 
        },
    'q16': {
        ' ': [' ', -1, 'q11'], 
        'a': ['a', -1, 'q11'], 
        'b': ['b', -1, 'q11'], 
        'c': ['c', -1, 'q11'], 
        },
    'q17': {
        ' ': [' ', -1, 'q12'], 
        'a': ['a', -1, 'q12'], 
        'b': ['b', -1, 'q12'], 
        'c': ['c', -1, 'q12'], 
        },
    'q18': {
        ' ': [' ', -1, 'q13'], 
        'a': ['a', -1, 'q13'], 
        'b': ['b', -1, 'q13'], 
        'c': ['c', -1, 'q13'], 
        },
    'q19': {
        ' ': [' ', 0, 'q9'], 
        'a': ['a', 1, 'q9'], 
        'b': ['b', 1, 'q9'], 
        'c': ['c', 1, 'q9'], 
        },
    'q20': {
        ' ': [' ', 0, 'q0'], 
        'a': [' ', 0, 'q0'], 
        'b': [' ', 0, 'q0'], 
        'c': [' ', 0, 'q0'], 
        },
}

while state != 'q0':
    symbol = memory[index]
    
    new_symbol, delta, state = table[state][symbol]
    memory[index] = new_symbol
    index += delta
print(''.join(memory))