table = {'q1': {'a': ('a', 0, 'q2'), ' ': (' ', 1, 'q1')},
         'q2': {'a': ('D', -1, 'qa'), 'b': ('D', -1, 'qb'), 'c': ('D', -1, 'qc'), 'D': ('D', 1, 'q2'), ' ': (' ', -1, 'q4')},
         'qa': {'a': ('a', -1, 'qa'), 'b': ('b', -1, 'qa'), 'c': ('c', -1, 'qa'), 'D': ('D', -1, 'qa'), ' ': ('a', 1, 'q3')},
         'qb': {'a': ('a', -1, 'qb'), 'b': ('b', -1, 'qb'), 'c': ('c', -1, 'qb'), 'D': ('D', -1, 'qb'), ' ': ('b', 1, 'q3')},
         'qc': {'a': ('a', -1, 'qc'), 'b': ('b', -1, 'qc'), 'c': ('c', -1, 'qc'), 'D': ('D', -1, 'qc'), ' ': ('c', 1, 'q3')},
         'q3': {'a': ('a', 1, 'q3'), 'b': ('b', 1, 'q3'), 'c': ('c', 1, 'q3'), 'D': ('D', 1, 'q2')},
         'q4': {'a': ('a', 0, 'q5'), 'D': (' ', -1, 'q4')}}

strip = [' '] * 15
strip += [x for x in input()]  # лента
strip += [' '] * 15
state = 'q1'  # состояние
pos = 0  # позиция

while state != 'q5':
    symb, step, state = table[state][strip[pos]]
    strip[pos] = symb
    pos += step

print(''.join(strip))
