#include "fifth_func.h"

void fifth_func() {
    wprintf(L"информация о функциях, которые реализует программа:\n"
            "0 – вывод текста после первичной обязательной обработки\n"
            "1 – подсчет и вывод в минутах количество секунд встречающихся в тексте\n"
            "2 – сортировка предложений по увеличению суммы кодов символов первого слова в предложении\n"
            "3 – замена всех символов ‘%’, ‘#’, ‘@’ на “<percent>”, “<решетка>”, “(at)” соответственно\n"
            "4 – удаление всех предложений, которые заканчиваются на слово с тремя согласными подряд\n"
            "5 – вывод справки о функциях, которые реализует программа.\n");
}
