# правила машины Тьюринга в виде таблицы
table = {
    'q1': {'a': ('a', 0, 'q2'), ' ': (' ', 1, 'q1')},
    'q2': {'a': ('D', -1, 'q3'), 'b': ('D', -1, 'q4'), 'c': ('D', -1, 'q5'), 'D': ('D', 1, 'q2'), ' ': (' ', -1, 'q7')},
    'q3': {'a': ('a', -1, 'q3'), 'b': ('b', -1, 'q3'), 'c': ('c', -1, 'q3'), 'D': ('D', -1, 'q3'), ' ': ('a', 1, 'q6')},
    'q4': {'a': ('a', -1, 'q4'), 'b': ('b', -1, 'q4'), 'c': ('c', -1, 'q4'), 'D': ('D', -1, 'q4'), ' ': ('b', 1, 'q6')},
    'q5': {'a': ('a', -1, 'q5'), 'b': ('b', -1, 'q5'), 'c': ('c', -1, 'q5'), 'D': ('D', -1, 'q5'), ' ': ('c', 1, 'q6')},
    'q6': {'a': ('a', 1, 'q6'), 'b': ('b', 1, 'q6'), 'c': ('c', 1, 'q6'), 'D': ('D', 1, 'q2')},
    'q7': {'a': ('a', 0, 'q8'), 'D': (' ', -1, 'q7')}
}

# Инициализация ленты с пробелами и ввод пользователя
strip = [' '] * 15
strip += [x for x in input()]
strip += [' '] * 15

# Начальные значения
state = 'q1'  # состояние
pos = 0  # Позиция

# Запуск машины Тьюринга
while state != 'q8':
    symb, step, state = table[state][strip[pos]]

    # Обновление ленты и позиции в соответствии с правилами
    strip[pos] = symb
    pos += step

print(''.join(strip))

