#include"../include/Reference.h"
//метод вызова справки
void Reference(){
    wprintf(L"%s\n%s\n%s\n%s\n%s\n%s\n",
                "0 - Вывод обработанного текста.",
                "1 - Определение количества палиндромов в предложении.",
                "2 - Замена всех специальных символов.",
                "3 - Сортировка предложений по уменьшению количества латинских букв.",
                "4 - Удаление всех предложений, в которых в одном слове встречаются латинские и кириллические буквы.",
                "5 - Вывод справочной информации.");
}
