tape = list(input())
state = "q1"
position = 0

table = {
    # Проход до начала слова
    "q1": {
        "a": ("a", "N", "q2"),
        "b": ("b", "N", "q2"),
        "c": ("c", "N", "q2"),
        " ": (" ", "R", "q1"),
    },
    
    # Проход до конца слова
    "q2": {
        "a": ("a", "R", "q2"),
        "b": ("b", "R", "q2"),
        "c": ("c", "R", "q2"),
        " ": (" ", "L", "q3"),
    },
    
    # Проход до первой "a"
    "q3": {
        "a": ("a", "L", "q4"),
        "b": ("b", "L", "q3"),
        "c": ("c", "L", "q3"),
        #" ": (),
    },
    
    # Проход до второй "a"
    "q4": {
        "a": ("a", "L", "q5"),
        "b": ("b", "L", "q3"),
        "c": ("c", "L", "q3"),
        #" ": (),
    },
    
    # Взятие символа перед "aa"
    "q5": {
        "a": ("a", "R", "q6"),
        "b": ("b", "R", "q7"),
        "c": ("c", "R", "q8"),
        #" ": (),
    },
    
    # Переименование символа после "aa" на "a"
    "q6": {
        "a": ("a", "R", "q6"),
        "b": ("a", "N", "qT"),
        "c": ("a", "N", "qT"),
        " ": ("a", "N", "qT"),
    },
    
    # Переименование символа после "aa" на "b"
    "q7": {
        "a": ("a", "R", "q7"),
        "b": ("b", "N", "qT"),
        "c": ("b", "N", "qT"),
        " ": ("b", "N", "qT"),
    },
    
    # Переименование символа после "aa" на "c"
    "q8": {
        "a": ("a", "R", "q8"),
        "b": ("c", "N", "qT"),
        "c": ("c", "N", "qT"),
        " ": ("c", "N", "qT"),
    },
}

while state != "qT":
    tape[position], route, state = table[state][tape[position]]
    position += ("L", "N", "R").index(route) - 1

print("".join(tape))
