memory = list(input())
index = 0
state = "q1"

table = { # q1 - начальное состояние, qe - конечное состояние
        "q1" : { # идем до 1 символа
            " " : (" ", "R", "q1"),
            "a" : ("a", "R", "q2"),
            "b" : ("b", "R", "q2"),
            "c" : ("c", "R", "q2"),
            },
        "q2" : { # идем до конца строки
            " " : (" ", "L", "q3"),
            "a" : ("a", "R", "q2"),
            "b" : ("b", "R", "q2"),
            "c" : ("c", "R", "q2"),
            },
        "q3" : { # идем в начало строки и находим первую a
            "a" : ("a", "L", "q4"),
            "b" : ("b", "L", "q3"),
            "c" : ("c", "L", "q3"),
            },
        "q4" : { # идем в начало строки и находи вторую a
            "a" : ("a", "L", "q5"),
            "b" : ("b", "L", "q3"),
            "c" : ("c", "L", "q3"),
            },
        "q5" : { # Смотрим на букву до 2 a
            "a" : ("a", "R", "q6"),
            "b" : ("b", "R", "q7"),
            "c" : ("c", "R", "q8"),
            },
        "q6" : { # Если это a
            " " : ("a", "N", "qe"),
            "a" : ("a", "R", "q6"),
            "b" : ("a", "N", "qe"),
            "c" : ("a", "N", "qe"),
            },
        "q7" : { # Если это b
            " " : ("b", "N", "qe"),
            "a" : ("a", "R", "q7"),
            "b" : ("b", "N", "qe"),
            "c" : ("b", "N", "qe"),
            },
        "q8" : { # Если это c
            " " : ("c", "N", "qe"),
            "a" : ("a", "R", "q8"),
            "b" : ("c", "N", "qe"),
            "c" : ("c", "N", "qe"),
            },
        }

moves = {
        "R" : 1,
        "N" : 0,
        "L" : -1
        }

while (state != "qe"):
    symbol = memory[index]
    new_symbol, move, state = table[state][symbol]
    memory[index] = new_symbol
    index += moves[move]

print(''.join(memory))
